tests/performance/artillery-config.yml
config:
  target: 'http://localhost:8080'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    # Load testing phase
    - duration: 300
      arrivalRate: 20
      name: "Load test"
    # Spike testing phase
    - duration: 120
      arrivalRate: 50
      name: "Spike test"
    # Sustained load
    - duration: 600
      arrivalRate: 30
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './performance-processor.js'

scenarios:
  - name: "Recommendation Generation Performance"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/recommendations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.recommendations"
              as: "recommendations"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: recommendations
      - think: 2

  - name: "Personalized Itinerary Generation"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/itinerary/generate"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            duration: 3
            interests: ["culture", "food", "nature"]
            budget: "medium"
            groupType: "couple"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: itinerary
      - think: 5

  - name: "Real-time Location Content"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/location/contextual"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            lat: 22.3193
            lng: 114.1694
            radius: 500
          expect:
            - statusCode: 200
            - contentType: json
      - think: 1

  - name: "Multi-language Content Delivery"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/recommendations"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Accept-Language: "zh-HK"
          expect:
            - statusCode: 200
            - contentType: json
      - think: 2